---
kind: method
id: M:Autodesk.Revit.DB.RevitLinkOptions.GetWorksetConfiguration
source: html/a091318c-df88-1ebf-c442-e15e869b0ce4.htm
---
# Autodesk.Revit.DB.RevitLinkOptions.GetWorksetConfiguration Method

Gets the set of worksets to open when creating the link.

## Syntax (C#)
```csharp
public WorksetConfiguration GetWorksetConfiguration()
```